Catalogs/бит_ПользовательскиеМакетыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеМакетыПечати</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОбластей</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизвольныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИнициализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТаблица</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъектаМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ПользовательскиеМакетыПечати/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ОткрытьМакетПечатнойФормыДляПросмотра()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресФайлаМакетаВоВременномХранилище", АдресФайлаВоВременномХранилище);
	ПараметрыОткрытия.Вставить("ИмяМакета"                           , Объект.ИмяМакета);
	ПараметрыОткрытия.Вставить("ИмяФайлаМакета"                      , Объект.ИмяФайла);
	ПараметрыОткрытия.Вставить("ТипМакета"                           , Объект.Расширение);
	ПараметрыОткрытия.Вставить("ТолькоОткрытие"                      , Истина);
	#Если ВебКлиент Тогда
		ПараметрыОткрытия.Вставить("ЭтоВебКлиент", Истина);
	#КонецЕсли
	
	ОткрытьФорму("Справочник.бит_ПользовательскиеМакетыПечати.Форма.РедактированиеМакета", ПараметрыОткрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ОткрытьМакетПечатнойФормыДляПросмотраЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетПечатнойФормыДляПросмотраЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетПечатнойФормыДляРедактирования()
	
	СписокНазначений = Новый СписокЗначений;
	Для каждого ЭлементНазначения Из Объект.Назначение Цикл
		СписокНазначений.Добавить(ЭлементНазначения.ПолноеИмяОбъектаМетаданных, ЭлементНазначения.Представление);
	КонецЦикла; 
	
	СписокПП = Новый СписокЗначений;
	Для каждого ЭлементПП Из Объект.ПроизвольныеПараметры Цикл
		СписокПП.Добавить(ЭлементПП.ИмяПараметра);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресФайлаМакетаВоВременномХранилище", АдресФайлаВоВременномХранилище);
	ПараметрыОткрытия.Вставить("ИдентификаторФормы"                  , ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("ИмяМакета"                           , Объект.ИмяМакета);
	ПараметрыОткрытия.Вставить("ИмяФайлаМакета"                      , Объект.ИмяФайла);
	ПараметрыОткрытия.Вставить("ТипМакета"                           , Объект.Расширение);
	ПараметрыОткрытия.Вставить("СписокНазначений"                    , СписокНазначений);
	ПараметрыОткрытия.Вставить("СписокПроизвольныхПараметров"        , СписокПП);
	#Если ВебКлиент Тогда
		ПараметрыОткрытия.Вставить("ЭтоВебКлиент", Истина);
	#КонецЕсли
	
	ПараметрыОткрытия.Вставить("АдресТаблицыОбластейВоВременномХранилище"  , АдресТаблицыОбластейВоВременномХранилище);
	ПараметрыОткрытия.Вставить("АдресТаблицыПараметровВоВременномХранилище", АдресТаблицыПараметровВоВременномХранилище);
	
	ОткрытьФорму("Справочник.бит_ПользовательскиеМакетыПечати.Форма.РедактированиеМакета", ПараметрыОткрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ОткрытьМакетПечатнойФормыДляРедактированияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакетПечатнойФормыДляРедактированияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура КонструкторМакета(Команда)
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		
	Исключение
		ТекстСообщения = НСтр("ru = 'Файл не найден'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	ОткрытьМакетПечатнойФормыДляРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		бит_ПрисоединенныеФайлыКлиент.СохранитьФайлКак(ПолучитьДанныеФайла());
		
	Исключение
		ТекстСообщения = НСтр("ru = 'Файл не найден'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		
	Исключение
		ТекстСообщения = НСтр("ru = 'Файл не найден'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки; 
	
	ОткрытьМакетПечатнойФормыДляПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Фыберите файл";
	Диалог.Фильтр    =    НСтр("ru = 'Документ Microsoft Word'") + " (*.docx)|*.docx|"
	+ НСтр("ru = 'Документ Microsoft Word 97-2003'") + " (*.doc)|*.doc|"
	+ НСтр("ru = 'Текст в формате RTF'") + " (*.rtf)|*.rtf|";
	
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = Диалог.ПолноеИмяФайла;
	
	ИмяФайла    = "";
	ИмяКаталога = "";
	Расширение  = "";
	бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьКаталогИИмяФайла(ВыбранныйФайл, "", ИмяФайла);
	Расширение = бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьРасширениеФайла(ИмяФайла);
	
	Файл                = Новый Файл(ВыбранныйФайл);
	Размер              = Файл.Размер();
	
	Объект.ИмяМакета           = ?(Расширение = "",ИмяФайла, Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина(Расширение) - 1));
	Объект.ИмяФайла            = ИмяФайла;
	Объект.ИмяКаталога         = ИмяКаталога;
	Объект.Расширение          = Расширение;
	Объект.Размер              = Размер;
	Объект.РазмерПредставление = бит_УправлениеЭлектроннойПочтойКлиентСервер.ПолучитьСтроковоеПредставлениеРазмераФайла(Размер);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ВыбранныйФайл);
	
	АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Этаформа.УникальныйИдентификатор);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокОб = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ПользовательскиеМакетыПечати"));
	
	АдресФайлаВоВременномХранилище = ДокОб.ПолучитьФайлХранилище(УникальныйИдентификатор);
	
	АдресТаблицыОбластейВоВременномХранилище = 
	ПоместитьВоВременноеХранилище(ДокОб.ТаблицаОбластей, УникальныйИдентификатор);
	АдресТаблицыПараметровВоВременномХранилище = 
	ПоместитьВоВременноеХранилище(ДокОб.ТаблицаПараметров, УникальныйИдентификатор);
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СохранитьФайлХранилище(АдресФайлаВоВременномХранилище);
	
	ТекущийОбъект.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"); 
	
	ТекущийОбъект.ДатаИзменения = ТекущаяДатаСеанса();
	
	ТекущийОбъект.ТаблицаОбластей   = ПолучитьИзВременногоХранилища(АдресТаблицыОбластейВоВременномХранилище);
	ТекущийОбъект.ТаблицаПараметров = ПолучитьИзВременногоХранилища(АдресТаблицыПараметровВоВременномХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьДанныеФайла()
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("СсылкаНаДвоичныеДанныеФайла"       , АдресФайлаВоВременномХранилище);
	ДополнительнаяИнформация.Вставить("ОтносительныйПуть"                 , "");
	ДополнительнаяИнформация.Вставить("ДатаМодификацииУниверсальная"      , Объект.ДатаИзменения);
	ДополнительнаяИнформация.Вставить("ИмяФайла"                          , Объект.ИмяФайла);
	ДополнительнаяИнформация.Вставить("Наименование"                      , Объект.ИмяМакета);
	ДополнительнаяИнформация.Вставить("Расширение"                        , Объект.Расширение);
	ДополнительнаяИнформация.Вставить("Размер"                            , Объект.Размер);
	
	ДополнительнаяИнформация.Вставить("Редактирует"                       , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	ДополнительнаяИнформация.Вставить("Зашифрован"                        , Ложь);
	ДополнительнаяИнформация.Вставить("ФайлРедактируется"                 , Истина);
	ДополнительнаяИнформация.Вставить("ФайлРедактируетТекущийПользователь", Истина);
	
	Возврат ДополнительнаяИнформация;
	
КонецФункции // ()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПользовательскиеМакетыПечати" Тогда
		
		АдресФайлаВоВременномХранилище             = Параметр.АдресФайлаМакетаВоВременномХранилище;
		АдресТаблицыОбластейВоВременномХранилище   = Параметр.АдресТаблицыОбластейВоВременномХранилище;
		АдресТаблицыПараметровВоВременномХранилище = Параметр.АдресТаблицыПараметровВоВременномХранилище;
		
		Модифицированность = Истина;
		
	КонецЕсли; 
	
	Если ИмяСобытия = "ВыборОбъектовМетаданных" Тогда
		ЗагрузитьВыбранныеОбъектыМетаданных(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Заблокирован() Тогда
		ТекущийОбъект.Разблокировать();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНазначенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = ПодготовитьПараметрыФормыВыборОбъектовМетаданных();
	ОткрытьФорму("ОбщаяФорма.бит_ВыборОбъектовМетаданных", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыФормыВыборОбъектовМетаданных()
	
	ФильтрПоСсылочнымМетаданным = Новый СписокЗначений;
	ФильтрПоСсылочнымМетаданным.Добавить("Справочники");
	ФильтрПоСсылочнымМетаданным.Добавить("Документы");
	
	ВыбранныеОбъектыМетаданных = Новый СписокЗначений;
	Для Каждого ЭлементНазначение ИЗ Объект.Назначение Цикл
		ВыбранныеОбъектыМетаданных.Добавить(ЭлементНазначение.ПолноеИмяОбъектаМетаданных);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборЕдинственного"                   , Истина);
	ПараметрыФормы.Вставить("КоллекцииВыбираемыхОбъектовМетаданных", ФильтрПоСсылочнымМетаданным);
	ПараметрыФормы.Вставить("ВыбранныеОбъектыМетаданных"           , ВыбранныеОбъектыМетаданных);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Назначение дополнительной обработки'"));
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьВыбранныеОбъектыМетаданных(Параметр)
	
	Объект.Назначение.Очистить();
	
	Для Каждого ЭлементПараметр Из Параметр Цикл
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ЭлементПараметр.Значение);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНазначение = Объект.Назначение.Добавить();
		СтрокаНазначение.ПолноеИмяОбъектаМетаданных = ЭлементПараметр.Значение;
		СтрокаНазначение.Представление              = ОбъектМетаданных.Синоним;
		
	КонецЦикла;
	
	Модифицированность = Истина;
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура УправлениеВидимостьюДоступностью()
	
	Если Объект.Назначение.Количество() = 0 Тогда
		ПредставлениеНазначения = НСтр("ru = 'Не определено'");
	Иначе
		ПредставлениеНазначения = "";
		Для Каждого СтрокаНазначение Из Объект.Назначение Цикл
			Если НЕ ПредставлениеНазначения = "" Тогда
				ПредставлениеНазначения = ПредставлениеНазначения + ", ";
			КонецЕсли;
			ПредставлениеНазначения = ПредставлениеНазначения + СтрокаНазначение.Представление;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // () 

&НаКлиенте
Процедура ПроизвольныеПараметрыКодИнициализацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ПроизвольныеПараметры.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст"              , ТекущаяСтрока.КодИнициализации);
	ПараметрыФормы.Вставить("ИдентификаторСтроки", ТекущаяСтрока.ПолучитьИдентификатор());
	
	ОткрытьФорму("Справочник.бит_ПользовательскиеМакетыПечати.Форма.ФормаРедактированияВыражения", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_ПользовательскиеМакетыПечати.Форма.ФормаРедактированияВыражения" Тогда
		
		СтрокаРедактирования = Объект.ПроизвольныеПараметры.НайтиПоИдентификатору(ВыбранноеЗначение.ИдентификаторСтроки);
		
		Если НЕ СтрокаРедактирования = Неопределено Тогда
			СтрокаРедактирования.КодИнициализации = ВыбранноеЗначение.Текст; 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры   
   
#КонецОбласти
